Autodesk.Revit.DB.Architecture.TopographySurface.FindPoints(Autodesk.Revit.DB.Outline)
Filters and returns only the points of the topography surface which lie within the input bounding box.
Remarks:
This applies to TopographySurface, SiteSubRegion, and the topography surface associated with a BuildingPad element.
boundingBox:
The 3D bounding box.
Returns:
The result points within the 3D bounding box
Throws Autodesk.Revit.Exceptions.ArgumentException:
boundingBox is an empty Outline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014